// ==UserScript==
// @name         FINAL FANTASY VIII Remastered
// @version      0.1
// @author       Koukdw
// @description  https://store.steampowered.com/app/1026680/FINAL_FANTASY_VIII__REMASTERED/
// * Square Enix
// 
// ==/UserScript==

const FFVIII_JP_dll = Process.findModuleByName("FFVIII_JP.dll");
const mainHandler = trans.send(handler, -200); // join 200ms
const charset = build_charset();

// Find the hookAddress
const dialogSig1 = 'E8 ???????? FF 46 30 83 C4 04 88 06 83';
let results = Memory.scanSync(FFVIII_JP_dll.base, FFVIII_JP_dll.size, dialogSig1);
if (results.length === 0) {
    console.error('[DialoguesPattern] no result!');
    return;
}
const hookAddress = results[0].address;
console.log('[HookAddress] ' + hookAddress);

// Get the address of the function
let ins = Instruction.parse(hookAddress);
const functionAddr = ins.operands[0].value;

// find memory offset - mov eax, dword_xxxxxxxxx[eax*4]
let pos = ptr(functionAddr)
let mem_offset = '';
for (let index = 0; index < 50; index++) {
    ins = Instruction.parse(pos);
    //console.log(ins);
    //console.log(index, JSON.stringify(ins, null, 2));
    if (ins.mnemonic === 'mov'
        && ins.operands[0].type === 'reg' && ins.operands[0].value === 'eax'
        && ins.operands[1].type === 'mem') {
        mem_offset = ptr(ins.operands[1].value.disp);
        break;
    }
    pos = ins.next;
}
console.log('[MemOffset] ' + mem_offset);

// find scene id address
const sceneIdPat = '66 39 05 ?? ?? ?? ?? 75 ?? 81';
results = Memory.scanSync(FFVIII_JP_dll.base, FFVIII_JP_dll.size, sceneIdPat);
if (results.length === 0) {
    console.error('[SceneIdPattern] no result!');
    return;
}
const sceneAddr = results[results.length -1].address;
ins = Instruction.parse(sceneAddr);
const sceneIdAddr = ptr(ins.operands[0].value.disp)
console.log('[SceneIdAddr] ' + sceneIdAddr);

Interceptor.attach(hookAddress, function () {
    const value = this.context.ebp.sub(0x10).readPointer();
    const offset_from_base = value.shr(0xc).shl(2);
    const address = mem_offset.add(offset_from_base).readPointer();
    let offset = value.and(0xfff);
    mainHandler(address.add(offset));
})

function handler(address) {
    console.warn(hexdump(address));
    let str = readFF8String(address);
    str = str.replace(/[「（][^]*?[」）]/gm, (content) => {
        return content.replace(/[\r\n|\r|\n]/g, '');
    });
    return str;
}


let currentSceneId = 0;
let lastSceneId = 0;
function readFF8String(address) {
    let s = '';
    let char = '';
    let c;
    let index = 0;
    currentSceneId = sceneIdAddr.readS16();
    if (currentSceneId !== lastSceneId) console.warn(`SWITCHING SCENE -> currentSceneId = ${currentSceneId}`);
    lastSceneId = currentSceneId;
    while ((c = address.readU8()) !== 0) { // terminated
        if (c < 0x20) {
            switch (c) {
                // Next page
                case 0x1:
                    char = "\r\n\r\n";
                    s += char;
                    address = address.add(1);
                    continue;
                // New Line
                case 0x2:
                    char = "\r\n";
                    s += char;
                    address = address.add(1);
                    continue;
                // Names
                case 0x3:
                    index = address.add(1).readU8();
                    let char_name = names[index];
                    s += char_name ? char_name : `[Name <0x${ptr(index)}>]`;
                    address = address.add(2);
                    continue;
                // Key (controller/keyboard button)
                case 0x5:
                    index = address.add(1).readU8();
                    if(index >= 0x30 && index <= 0x3f) index -= 0x10;
                    let key = `<${keys[index]}>`;
                    s += key ? key : `[Key <0x${ptr(address.add(1).readU8())}>]`;
                    address = address.add(2);
                    continue;
                // Color
                case 0x6:
                // Delay
                case 0x9:
                // Special value
                case 0xA:
                // SpellID
                case 0xC:
                    index = address.add(1).readU8();
                    console.warn(`<${c}->${ptr(index)}`);
                    address = address.add(2);
                    continue;
                // Cursor locations
                case 0xB:
                    address = address.add(2); // 2 for now but it can also take 3 value
                    continue;
                // Terms
                case 0xE:
                    index = address.add(1).readU8();
                    let term = terms[index];
                    s += term ? term : `[Term <0x${ptr(index)}>]`;
                    address = address.add(2);
                    continue;
                // 2 bytes charset 19
                case 0x19:
                    index = address.add(1).readU8();
                    s += charset["jp19"][index - 0x20];
                    address = address.add(2);
                    continue;
                // 2 bytes charset 1A
                case 0x1A:
                    index = address.add(1).readU8();
                    s += charset["jp1A"][index - 0x20];
                    address = address.add(2);
                    continue;
                // 2 bytes charset 1B
                case 0x1B:
                    index = address.add(1).readU8();
                    s += charset["jp1B"][index - 0x20];
                    address = address.add(2);
                    continue;
                // 2 bytes dynamic charset 1C (depends on the scene id)
                case 0x1C:
                    if (charset["jp1C"][currentSceneId]) {
                        index = address.add(1).readU8();
                        const currentCharset = charset["jp1C"][currentSceneId];
                        s += currentCharset[index - 0x20];
                    }
                    else {
                        s += `<1c ${ptr(index)}>`;
                    }
                    address = address.add(2)
                    continue;

                default:
                    console.warn("Undefined opcode: ", c);
                    address = address.add(1);
                    continue;
            }
        }
        else {
            s += charset["jp"][c - 0x20];
            address = address.add(1);
        }
    }
    return s;
}


const names = {
    0x30: "スコール",               // Squall
    0x31: "ゼル",                   // Zell
    0x32: "アーヴァイン",           // Irvine
    0x33: "キスティス",             // Quistis
    0x34: "リノア",                // Rinoa
    0x35: "セルフィ",              // Selphie
    0x36: "サイファー",            // Seifer
    0x37: "イデア",                // Edea
    0x38: "ラグナ",                // Laguna
    0x39: "キロス",                // Kiros
    0x3A: "ウォード",              // Ward
    0x3B: "アンジェロ",            // Angelo1
    0x3C: "グリーヴァ",            // Griever
    0x3D: "モーグリ",              // Mog
    0x3E: "チョコボ",              // Chocobo
    //   UnknownCharacter2 = 0x3F,
    0x40: "アンジェロ",            // Angelo2
    //   UnknownCharacter3 = 0x50,
    //   UnknownCharacter4 = 0x60
}

const keys = {
    0x20: "EscapeLeft",
    0x21: "EscapeRight",
    0x22: "RotateLeft", 
    0x23: "RotateRight",
    0x24: "Cancel",
    0x25: "Menu",
    0x26: "Confirm",
    0x27: "Cards",
    0x28: "Select",
    0x2b: "Pause",
    0x2c: "Up",
    0x2d: "Right",
    0x2e: "Down",
    0x2f: "Left",

    0x41: "JunctionSYM",
    0x42: "Arrow_Right",
    0x43: "Star",
    0x44: "InParty",
    0x45: "Ability_Junction",
    0x46: "Ability_Command",
    0x47: "Ability_Character",
    0x48: "Ability_Character2",
    0x49: "Ability_Party",
    0x4a: "Ability_GF",
    0x4b: "Ability_Menu",
    0x4c: "Item_Recovery",
    0x4d: "Item_GF",
    0x4e: "Item_Tent",
    0x4f: "Item_Battle",
    0x50: "Item_Ammo",
    0x51: "Item_Magazine",
    0x52: "Item_Misc",
    0x53: "Status_Death",
    0x54: "Status_Poison",
    0x55: "Status_Petrify",
    0x56: "Status_Darkness",
    0x57: "Status_Silence",
    0x58: "Status_Berserk",
    0x59: "Status_Zombie",
    0x5a: "Status_Deathhex1",
    0x5b: "Status_Deathhex2",
    0x5c: "Status_Deathhex3",
    0x5d: "Element_Fire",
    0x5e: "Element_Ice",
    0x5f: "Element_Thunder",
    0x60: "Element_Earth",
    0x61: "Element_Poison",
    0x62: "Element_Wind",
    0x63: "Element_Water",
    0x64: "Element_Holy",
    0x65: "Status_Deathex",
    0x66: "Status_Poisonex",
    0x67: "Status_Petrifyex",
    0x68: "Status_Darknessex",
    0x69: "Status_Silenceex",
    0x6a: "Status_Berserkex",
    0x6b: "Status_Zombieex",
    0x6c: "Status_Sleep",
    0x6d: "Status_Slow",
    0x6e: "Status_Stop",
    0x6f: "Status_Curse",
    0x70: "Status_Confuse",
    0x71: "Status_Drain",
    0x72: "Icon_Status_Attack",
    0x73: "Icon_Status_Defense",
    0x74: "Icon_Elemental_Attack",
    0x75: "Icon_Elemental_Defense",
    0x76: "Stats_Hit_Points",
    0x77: "Stats_Strength",
    0x78: "Stats_Vitality",
    0x79: "Stats_Magic",
    0x7a: "Stats_Spirit",
    0x7b: "Stats_Speed",
    0x7c: "Stats_Evade",
    0x7d: "Stats_Hit",
    0x7e: "Stats_Luck",
    0x7f: "Finger_Right",

    0xfd: "ExitMenu",
    0xfe: "Reset",
    0xff: "Exit"
}



const terms = {
    0x20: "ガルバディア",                    // Galbadia
    0x21: "エスタ",                         // Esthar
    0x22: "バラム",                         // Balamb
    0x23: "ドール",                         // Dollet
    0x24: "ティンバー",                     // Timber
    0x25: "トラビア",                       // Trabia
    0x26: "セントラ",                       // Centra
    0x27: "フィッシャーマンズ・ホライズン",   // Fishermans Horizon
    0x28: "学園東",                         // East Academy
    0x29: "砂漠収容所",                     // Desert Prison
    0x2a: "トラビアガーデン",               // Trabia Garden
    0x2b: "ルナサイドベース",               // Lunar Base
    0x2c: "シュミ族の村",                   // Shumi Village
    0x2d: "デリングシティ",                 // Deling City
    0x2e: "バラムガーデン",                 // Balamb Garden
    0x2f: "学園東駅",                       // East Academy Station
    0x30: "ドール駅",                       // Dollet Station
    0x31: "収容所駅",                       // Desert Prison Station
    0x32: "ルナゲート",                     // Lunar Gate
    0x33: "かいふく",                       // Restore
    0x34: "ステータス",                     // Status
    // Learns,
    0x36: "アビリティ",                     // Ability,
    0x37: "まほう",                         // Magic
    // Refine,
    0x39: "ジャンクション",                 // Junctions
    // Raises,
    // Command,
    // Magazine,
    0x3d: "アルティミシア城",               // Ultimecia Castle
    0x3e: "ガーデン",                      // Garden
    0x3f: "デリング"                       // Deling
}


function build_charset(){
    const charset_evn_odd = {
        72: [
            "編開就式車致局到都計務基",
            "楽還任列拉直森首閉刑施後"
        ],
        73: [
            "壱四就拉到都刑",
            "弐還任致首閉"
        ],
        77: [
            "俊幸噴械ｌｎｈｒｓｍ奥潮想ｚｙ昔日起涙挺映聴",
            "旅亡脱歌ａｇｏｕｂｊ夜騒ｉｔ演刑拷ｃ短仕撮専"
        ],
        78: [
            "僕刑ｓ枯邪梅虚様拾日案派像扉鍵寄髮達氏包夕任句恋脱衣渡令曜想瞳哀嫌去背痴登呂緒周豆ａ凍奥囚首途ｂ桃担歌監【滑底弐憂景都台潜奇壁衛灰遊矢ｉｐｔｌｇｒｈｚ咲故ｊ誇捻春怯ｗ",
            "替ｖ才微香娘宗年挺印委映刻納岩座友彼服由就文仕拷晚八起土夜踊閉送再捜愚撮猿悲独幸屍管伏房抱猫昔埋穴縦総督】沼壱四弔涙狙奴然朗漂識叫泳ｏｎｍｕｄ累ｃｋ狂証訳ｙ潰窓ｆ泣"
        ],
        79: [
            "観ａ斜岩崩留印首昼去般拉控到送護準登色宿案起ｓ紙掛阿】",
            "令想穴然壁脱央縦夜匹蛇致根再亡衛迎徒替曲都ｖ絵仕→【"
        ],
        80: [
            "馬田舎張印読戻録揺送木侵閉笛扉到拍鶏衝宅痛紙募ｇｔｋ刑観管ｓｄ緩投ｒ鍵映鳴；＾ｗｌ噴猫縛ｃ被鎧滴蓋鮮日歳故欄易納服再仕標奥疲",
            "江厩京房壁拡登踏茂叩軋鐘臟替座蹴勢床川模汎渡停ｍｉａ土識源ｕ唱演ｂｏ舵ｎ穴＿這ｐ声岩普雨ｆ窓譜棺朝和志縁景辟凍削済起灯郎歯訴"
        ],
        82: [
            "幽恋削獣ｕｙ景井端幕借起潜年坂揮様枕遊老婦棚覧委泊※塗令",
            "坊短服還ａｔｓ仮抜想占公肉釣静＿奥隣杉旅夫貸閲送腹再詮司"
        ],
        83: [
            "瀬ｖ印観替】横狙準演漂起涙鍵鐘旅達父描払険",
            "去ｓ脱歴【到閉昼夜窓管服普橋監夫盛品採冒"
        ],
        84: [
            "雨去役",
            "宿縦"
        ],
        87: [
            "色案奇予旅都",
            "町猟紀蒸老品"
        ],
        88: [
            "首遭涙騒境 留拘拉控送絵紙",
            "都遇潮環→到観令致根登再阿"
        ],
        90: [
            "服",
            "任"
        ],
        91: [
            "派契例充署",
            "遣独補願"
        ],
        95: [
            "汝戻簡短",
            "尽再繰寸"
        ],
        98: [
            "↑",
            "印"
        ],
        101: [
            "戻",
            ""
        ],
        102: [
            "争惑日静巻和那奥労母締盛徒",
            "迷嬉坊台染旦似因怖甘危預勉"
        ],
        103: [
            "赦娘令揮寝鼻親日坊躍横声",
            "張司様昼根起没戻貴索鳴"
        ],
        104: [
            "観屈例綺姉包抜尋】旅才雰滞",
            "仕起労麗菓授祈【読底若囲占"
        ],
        105: [
            "腹文揮似貨寝拠戻",
            "張句症緒踏占却捜"
        ],
        106: [
            "往付借観旅色準演緒争衣台興募凄夫冗抜久噂僕看登鍛貴勉",
            "奴払由然適徒彼奏聴服舞戻才匠丈簡談拳輩願熱板遂親喜尋"
        ],
        107: [
            "妻願娘丈様詳司揮",
            "緒日坊夫益滞令許"
        ],
        108: [
            "付申暮抜田奥緒斐資巻読胸",
            "慮町房雅舎様浪投宿委旅"
        ],
        109: [
            "司寝派肯仕悲",
            "令考従戻泣"
        ],
        110: [
            "【読児",
            "】声"
        ],
        112: [
            "旅昔疲寝考恵隣坂歴父貴塞泊",
            "釣様働起怖困日僕史坊占母遊"
        ],
        113: [
            "親預戻夫父泣様捕遊",
            "隣準丈母坊抜凄揮"
        ],
        114: [
            "母緒坊授標働扱仕迷申様絵丈戻",
            "友願日股辛焼慣専惑訳傘傑夫達"
        ],
        115: [
            "母貸緒仕余",
            "台焼起招裕"
        ],
        117: [
            "慮座迷然談敬躍逆片台嬉汚】",
            " 謝惑冗尊争静熱没勢旧【"
        ],
        118: [
            "坊遊日迷赦仕寝拾【",
            "貴僧母惑並昼屈緒】"
        ],
        119: [
            "母騒瞬尽色片締嘩貴危丈服裕",
            "考起焼灰髮日喧坊準邪夫余"
        ],
        120: [
            "戻若",
            "駆仕"
        ],
        121: [
            "徒濯緒授鼻妹遊挑丈求析任迷捕匹抜父暇",
            "洗若考歌然日奥坊夫静璧賭惑貴夕飯仕"
        ],
        122: [
            "親揮町嫌彼険寝令替遅索絶払竹肝財固張絡敏奥起察焼挑",
            "授様準考危昼司釣秒許声賞松梅玉布穴年鼻慣珍観推台"
        ],
        123: [
            "若土省張暮故油毎詰悩嬢",
            "由産疲日戻郷汚色珍菓喜"
        ],
        124: [
            "屈声令匂拠揮匹日替頑腹戻",
            "飲司睨証映釣座索仕張困"
        ],
        125: [
            "坊夫娘痛卒年迎絵父坂登潮看磨文似妻",
            "丈僧赦僕十旅考描色駆町香板冴逆詩厳"
        ],
        126: [
            "旦賞揮若町鳴令仰渡任寝険戻緒罪痛日適",
            "那捕茶母索司絶談責昼危寄起軽巻閉録"
        ],
        127: [
            "観送土扱社栄年昼驚符科監盛払険",
            "況旅産撮仕占揮寝奴購暮達採冒"
        ],
        128: [
            "司腹昨占寝抗都昼様",
            "令崩日捜遅許揮邪凡"
        ],
        129: [
            "課準戻",
            "資願"
        ],
        130: [
            "準",
            ""
        ],
        132: [
            "徒冗",
            "魅談"
        ],
        136: [
            "準須【伸",
            "徒戻】詳"
        ],
        137: [
            "日余仕想疲興掛授慣戻挨就節役四願似才ヶ",
            "課裕予委僕遊ｏ起然奴拶任年団久旅彼歴去"
        ],
        138: [
            "徒候検護願",
            "揮補級悔仕"
        ],
        139: [
            "日標然吹邪丈【暑授抜則猛輩頑紅案板",
            "晴資駄妹寝夫】勉徒奴社省励張色央"
        ],
        140: [
            "年僕団",
            "輩補貸"
        ],
        142: [
            "奥派然日邪丈漂騒役旅喜般授様姿頑達則猛",
            "起狩腰妹寝夫輩奴考委勉徒秀勇並張静社省"
        ],
        143: [
            "徒狙災至登",
            "争扉閉戻"
        ],
        144: [
            "拳夫担求卑",
            "丈年罵横怯"
        ],
        145: [
            "委算挑役並屈仕覧奪授虜促頑声却付融妨恋募答年",
            "予削勉紀茶菓閲読昔日戻忙張飲旅懸彼害充望僕"
        ],
        146: [
            "奴騒揮輩",
            "考起彼"
        ],
        147: [
            "奪深答熱肉似僕",
            "委考色爽読荷年"
        ],
        148: [
            "考然組委勉読秀熱拶彼声暇占積◎☆恋付捕想障周祝慎",
            "適仕鑑純巻旅貸挨答色静肉評鈍★隕清深由築害囲福傷"
        ],
        150: [
            "戻去巻読協机組望僕絶騒姉",
            "委杯徒勧勉掃菓募希推厳"
        ],
        152: [
            "拳",
            ""
        ],
        153: [
            "陣友",
            "悟"
        ],
        154: [
            "飲委邪致仕並準逮油親討営働訳年秀悟迷派却抜孝争案",
            "紀忙遅傷証日則捕濃旅伐職若去然珍考惑寂髮挑量毎"
        ],
        155: [
            "奴騒揮替夫",
            "考起彼丈"
        ],
        156: [
            "日張様夜罪景年補派況犠服",
            "緊奥考授友令候郎狩価牲踏"
        ],
        158: [
            "彫",
            ""
        ],
        159: [
            "【戻替",
            "】服済"
        ],
        160: [
            "捕様",
            "貴派"
        ],
        161: [
            "昨",
            "日"
        ],
        162: [
            "便役徒規従織依都様誠妨考ｚ親日腹恋課",
            "任没般則組答況派忠誓害抗週映昔甘悩吹"
        ],
        163: [
            "許替補】夜派毎叱",
            "服候【送奴況年"
        ],
        164: [
            "危年【絶衝準",
            "険輩】緒耐"
        ],
        165: [
            "徒週由答模害然僕病痛抜】送様惑談授任団捜誉",
            "標般述規障年令緒腰日【繰児迷冗板戻仕夜挑誘"
        ],
        166: [
            "【侵陣護達栄",
            "】貸準揮緒"
        ],
        167: [
            "徒様【許挑夜抜僕四姿狩丈捜西去和派掛鍛",
            "ｏ至】団日誉準首彼久令夫占服独鈍幸喜"
        ],
        168: [
            "久彼遊悲日騒捜夫夜",
            "寂委耳輩色起丈僕"
        ],
        169: [
            "【戻補略侵",
            "】絶緒穴"
        ],
        170: [
            "令考責況揮候懲団序仕従公惜抜】送脳児勤昔",
            "謝徒任善年補罰秩維傭契雇日【繰夜ｏ恥働然"
        ],
        171: [
            "娘僕姉泣久様起団巻働日拾年",
            "勉委菓戻昔識汗奴繰彼寝根"
        ],
        172: [
            "夜様故",
            "貴派障"
        ],
        173: [
            "徒",
            ""
        ],
        174: [
            "夜普ｏ至】許喜嘘談夫奴団",
            "案徒様【央送泣冗丈舞久四"
        ],
        175: [
            "組緒嫌担惑勢誉辱任傭紀候廃公慢雰怖",
            "彼朝徒迷総然屈隣誇従委補棄稼想囲"
        ],
        176: [
            "狩因惑委労険奥再衝拶",
            "派困紀泣危【】総挨繰"
        ],
        177: [
            "板徒疲西争委唯甘資許",
            "簡借替競並緒夜様端"
        ],
        178: [
            "久勢誉辱彼誇従",
            "総然屈隣任傭"
        ],
        179: [
            "茶丈泣旅然四彼訳冗嘘",
            "派夫旧昔団年座案談働"
        ],
        180: [
            "丈痛絡年絶恥】児声去瞬起像傭怖婚働興彼莫遣考望姿",
            "夫仕徒寝日【孤院壁送答想誇任奥幸資投維派卒希漂"
        ],
        181: [
            "登",
            ""
        ],
        182: [
            "徒旅延勉絡駆紛唯働",
            "戻卒達友抜絶争委貴"
        ],
        183: [
            "派張",
            "頑"
        ],
        184: [
            "演付考夫彼",
            "奏並丈僕朝"
        ],
        185: [
            "衛【戻興絶",
            "護】委組"
        ],
        186: [
            "貴派",
            "様"
        ],
        187: [
            "戻",
            ""
        ],
        188: [
            "寝起由喜奴【戻拠",
            "送貸謝任緒】侵借"
        ],
        189: [
            "営潔遂深日婦",
            "簡令仕毎夫危"
        ],
        191: [
            "旅考柄",
            "姿絵様"
        ],
        192: [
            "声僕郎去十考衣",
            "捜亡談戻年遅様"
        ],
        193: [
            "様談縁送想誠従伐乏捕夫営",
            "秒因令予讐首討貧緒徒婦"
        ],
        194: [
            "【例",
            "】準"
        ],
        197: [
            "秒",
            "閉"
        ],
        200: [
            "様丈痛戻",
            "絶夫怖"
        ],
        202: [
            "危仕衝",
            "険準"
        ],
        204: [
            "丈危喜",
            "夫険"
        ],
        205: [
            "迫】",
            "【"
        ],
        208: [
            "深",
            ""
        ],
        209: [
            "困",
            ""
        ],
        210: [
            "驚戻",
            "閉"
        ],
        214: [
            "派役【飼誘",
            "年姉】緒"
        ],
        215: [
            "悲",
            "鳴"
        ],
        217: [
            "悲噂端",
            "鳴団貸"
        ],
        218: [
            "【",
            "】"
        ],
        219: [
            "危甘毎郎貴丈",
            "険痛日派様夫"
        ],
        220: [
            "奴騒揮映役",
            "考起彼像"
        ],
        221: [
            "委準",
            "忙踊"
        ],
        222: [
            "秀緒嫌夫灯則紀服【",
            "踊徒丈令規戻委替】"
        ],
        223: [
            "仮墜払",
            "秒ｔ額"
        ],
        224: [
            "占駒貴勉役補腹枝",
            "拠派様若僕刺楊"
        ],
        225: [
            "般派様",
            "徒貴"
        ],
        226: [
            "服徒緊鈍",
            "替噂張"
        ],
        227: [
            "駒馬緒付日張幸病康",
            "派鹿任輩頑談邪資"
        ],
        228: [
            "捜貴夕準年委友深談",
            "派様緒去掛卒達冗因"
        ],
        229: [
            "悩純",
            "徒"
        ],
        230: [
            "占協貴紙章僕勉",
            "拠派様文読科"
        ],
        231: [
            "捜令許",
            "緒願"
        ],
        232: [
            "日昨夕由【課様許惑困髪普遅科委文並没",
            "予考週準】朝栄迷汚茶僕服刻紀厳募巡"
        ],
        233: [
            "年張護険】",
            "緊僕危【"
        ],
        234: [
            "源疲",
            "日"
        ],
        235: [
            "準徒登済索◎【似般律膨因承規卒授抜病担専灯覧貸静望秩任弁賞緊友為善汚責奥児誘歳努役誓許日資唱和誇送遣駆府請払紀春夏秋談争量珍屑昆版訂＿↑揮",
            "■識録検予◆疑】積組副証祖則到飲充品従午観由付希営序夜服罰践範彰厳慎考年童脱才惜志求誕迎提留模兼派傭政団護購委慰暇冬毎十然紙却鑑荷箱様再"
        ],
        236: [
            "委去資協胸募然考絶根勉ｔ【挨公準令達奴任副納戻囲争歴和刑脱許阻硬謝付様送揮夫観慣渉興盛険縦似晴映求 偵泊舎景演慢志徒",
            "僕卒春甘願年友緒日仕悔ｓ】拶標途担拍彼◎詳登雰論因史組拷憎潜危労証縁賛旅丈想察干析奮紀冒迎勇趣役酒省占宿迷恩像営尊"
        ],
        237: [
            "似服【",
            "替任】"
        ],
        240: [
            "服",
            "替"
        ],
        241: [
            "服",
            "替"
        ],
        243: [
            "似服【",
            "替任】"
        ],
        245: [
            "仕】寝派屈考起案勉夫緒余夜茶揮委",
            "【服替戻嫌騒様令丈眉晴悩壁飲奥至"
        ],
        246: [
            "仕】寝四団登盛",
            "【服屈久首短"
        ],
        248: [
            "夜仕歳年壁納",
            "緒従資嫌荷"
        ],
        251: [
            "派誇迫商価組授批令輩途年考深起【渡役",
            "遣傭短品任証及戻送再端由評賭準】録"
        ],
        252: [
            "徒",
            ""
        ],
        253: [
            "揮考年緊ａ検壁固絶徒余奮勇疲",
            "役準送祈ｘ級怠納奪願興僕慕辛"
        ],
        254: [
            "任【騒罪観奥",
            "僕】謝様察挑"
        ],
        255: [
            "僕揮担】固縦努詳仕慕",
            "徒執【様考根喜案勇"
        ],
        257: [
            "捜去由焼繰揮職討陣委資充専縦】町送服総挨奥況準許児舞院台囲伸唯久四涼芸驚日姿彼疲",
            "令狙索払迷願徒伐考役補担緒【戻拠征再衝拶肢護簡仕懐孤灯土静昔都団納演僕嬉首軽公"
        ],
        258: [
            "冗願駄縦考令謝様察徒",
            "談曲釈仕許騒罪観深"
        ],
        259: [
            "揮考年送検祈ｘ壁固絶徒余奮勇疲",
            "役準組緊討ａ級怠納奪願興僕慕辛"
        ],
        260: [
            "願任派請補責想令簡戻端緊郎然",
            "況公遣候排予準絶侵片従張様"
        ],
        261: [
            "公遣域周況排戻",
            "派請棄再任展迎"
        ],
        262: [
            "奴郎色",
            "考朝"
        ],
        263: [
            "様♪恋飼",
            "専僕任到"
        ],
        264: [
            "疲夫仕林年組停困様任",
            "丈喜短囲占織到奴考留"
        ],
        265: [
            "【汽興豪旅僕逆",
            "】横底華様郎"
        ],
        266: [
            "都",
            ""
        ],
        267: [
            "【被繰拳再到狙瞬張耐美求任願疑検律端志険",
            "】害申屈様役丸緊僕考秀嫌仕礎似組識公危簡"
        ],
        268: [
            "然察仕香文",
            "偵予様昔"
        ],
        269: [
            "岩彫妙服察",
            "然奇戒偵任"
        ],
        273: [
            "普罰悔",
            "声刑勇"
        ],
        276: [
            "汝伏尽再",
            "組届戻"
        ],
        277: [
            "汝伏尽赦捧再",
            "組届悟栄戻"
        ],
        278: [
            "汝伏尽再",
            "組届戻"
        ],
        279: [
            "汝伏尽再",
            "組届戻"
        ],
        280: [
            "像汝伏尽再",
            "埋組届戻"
        ],
        281: [
            "汝伏尽再",
            "組届戻"
        ],
        282: [
            "汝伏尽再",
            "組届戻"
        ],
        283: [
            "汝伏尽再",
            "組届戻"
        ],
        284: [
            "汝伏尽再",
            "組届戻"
        ],
        285: [
            "像汝伏尽再",
            "埋組届戻"
        ],
        286: [
            "汝伏尽恥再",
            "組届背戻"
        ],
        287: [
            "坊謝曲険笛払起 興親考価張戻匂奏棲商級勢",
            "日祝冒捕許測鳴 匹登為頑奪含色域任【】証"
        ],
        288: [
            "坊謝曲険笛払起 興親考価張戻匂奏棲商級勢",
            "日祝冒捕許測鳴 匹登為頑奪含色域任【】証"
        ],
        289: [
            "坊謝曲険笛払起 興親考価張戻匂奏棲商級勢",
            "日祝冒捕許測鳴 匹登為頑奪含色域任【】証"
        ],
        290: [
            "奪勢年商親披【",
            "坊揃域抜証露】"
        ],
        291: [
            "坊謝曲険笛払起 興親考価張戻匂奏棲商【】証",
            "日祝冒捕許測鳴 匹登為頑奪含色域任囲級勢"
        ],
        292: [
            "坊謝曲険笛払起 興親考価張戻匂奏棲商独【】証",
            "日祝冒捕許測鳴 匹登為頑奪含色域任孤根級勢"
        ],
        293: [
            "坊謝曲険笛払起 興親考価張戻匂奏棲商【】証",
            "日祝冒捕許測鳴 匹登為頑奪含色域任遊級勢"
        ],
        294: [
            "【",
            "】"
        ],
        299: [
            "【蒸再鳴起",
            "】量準予"
        ],
        300: [
            "稼蒸充▽□",
            "予補緊■"
        ],
        301: [
            "【端底稼蒸扉量]■□囲閉夫",
            "】伸棄予況▽[▼‾◎♂再適"
        ],
        302: [
            "予扉■",
            "蒸▼□"
        ],
        303: [
            "予扉為▼□",
            "蒸適稼■"
        ],
        304: [
            "扉予■",
            "▼蒸□"
        ],
        305: [
            "扉予■",
            "▼蒸□"
        ],
        306: [
            "【扉蒸訳■‾任  担",
            "】予申▼□械憩唸再令"
        ],
        307: [
            "【臆",
            "】病"
        ],
        309: [
            "【",
            "】"
        ],
        310: [
            "【",
            "】"
        ],
        313: [
            "忙送日起域",
            "公昨再奴組"
        ],
        314: [
            "令補】標",
            "候【遅"
        ],
        315: [
            "担任脳筋奴】",
            "公屈噌肉【"
        ],
        316: [
            "職仕払【",
            "抜耳日】"
        ],
        317: [
            "【迷丈",
            "】西夫"
        ],
        318: [
            "泊申普予【",
            "案付喋願】"
        ],
        319: [
            "【読",
            "】"
        ],
        320: [
            "奴絵腹景困",
            "首脇普遊"
        ],
        322: [
            "公】閉派候頂巣",
            "【遊油遣補様"
        ],
        323: [
            "箇考許迷崖",
            "怖勢案令"
        ],
        325: [
            "遅郎",
            "普緒"
        ],
        328: [
            "郎",
            ""
        ],
        330: [
            "担令屈迎邪",
            "域到歓仕"
        ],
        331: [
            "公丈考昔税役",
            "痛夫張雇奴"
        ],
        332: [
            "屈頂従怯奴【",
            "耐令卑謝標】"
        ],
        333: [
            "屈頂従怯奴",
            "耐令卑謝標"
        ],
        334: [
            "静勘泳絶緒奴丈親財貯",
            "年熱縦勉似慢夫孝産"
        ],
        335: [
            "若魅酒起仕朝飲和腹",
            "奴趣雇困杯晚遊拾"
        ],
        336: [
            "困奴仕】監父盛描払険",
            "案考【読旅達品採冒"
        ],
        337: [
            "昔崖輩為年読酒飲勢旨涯週痛勇汚奴色妻秋似危途付",
            "惜貰悲緒納漬噂酔狩日彼腹悩冊暖夏夜尻娘春戻溺券"
        ],
        338: [
            "母嫌孫",
            "絵嬢"
        ],
        339: [
            "域央戻",
            "【】"
        ],
        341: [
            "省腹遊仕",
            "脇絵答"
        ],
        342: [
            "担腹",
            "慮痛"
        ],
        343: [
            "遅",
            ""
        ],
        344: [
            "【】病",
            "央臆屈"
        ],
        345: [
            "吹",
            "絶"
        ],
        346: [
            "伸乞招友案望",
            "裔願印美嫌仕"
        ],
        347: [
            "久療",
            "職"
        ],
        349: [
            "【",
            "】"
        ],
        350: [
            "阻戻望",
            " 様"
        ],
        351: [
            "日戻望勇夫",
            "疲若友丈"
        ],
        352: [
            "日迎若",
            "戻廃革"
        ],
        353: [
            "紀戻",
            "委"
        ],
        354: [
            "拾穴",
            "鍵胸"
        ],
        355: [
            "拾穴",
            "鍵胸"
        ],
        357: [
            "【",
            "】"
        ],
        358: [
            "背腹須",
            "鼻岩"
        ],
        368: [
            "考",
            ""
        ],
        369: [
            "達",
            ""
        ],
        370: [
            "考",
            ""
        ],
        371: [
            "考",
            ""
        ],
        378: [
            "凄到声然渡奪",
            "奴達驚都矢"
        ],
        380: [
            "若冗酒【",
            "令談飲】"
        ],
        381: [
            "奴才仕危丁",
            "省泣掛普絶"
        ],
        387: [
            "短被普",
            "岩害"
        ],
        390: [
            "岩",
            "緒"
        ],
        400: [
            "【",
            "】"
        ],
        401: [
            "【",
            "】"
        ],
        402: [
            "首周",
            "都"
        ],
        403: [
            "首",
            "都"
        ],
        408: [
            "周科",
            "考読"
        ],
        411: [
            "途様巡",
            "周勢"
        ],
        414: [
            "様科揃静和首迷妙",
            "年似然暮努都昔"
        ],
        420: [
            "描険",
            "危"
        ],
        422: [
            "払央",
            "起"
        ],
        423: [
            "払足 準<",
            "起央残俺>"
        ],
        424: [
            "狭紛",
            "考"
        ],
        425: [
            "旅 友予涙",
            "橋年嫌想繰"
        ],
        427: [
            "汚",
            ""
        ],
        429: [
            "駄",
            ""
        ],
        431: [
            "母駄服都ｎ’ｔｌｄｐａ",
            "親娘首ｉｒｓｏｕｈｙ"
        ],
        432: [
            "丈泣ｎ’ｔｌｄｐｙ投怖秋",
            "夫ｉｒｓｏｕｈｊａ稿季"
        ],
        433: [
            "首",
            "都"
        ],
        434: [
            "困",
            ""
        ],
        436: [
            "困",
            ""
        ],
        437: [
            "危考都",
            "険首巡"
        ],
        438: [
            "狭",
            "由"
        ],
        439: [
            "首",
            "都"
        ],
        440: [
            "衛【由丈遅珍観",
            "町】周夫起年仕"
        ],
        441: [
            "邪",
            "敬"
        ],
        442: [
            "予印首抜科仮",
            "封預都年和待"
        ],
        443: [
            "首由妙細危械",
            "都周繊様険考"
        ],
        444: [
            "【",
            "】"
        ],
        445: [
            "首",
            "都"
        ],
        446: [
            "由迎危",
            "周準険"
        ],
        451: [
            "予印政預役都",
            "封外府案首待"
        ],
        452: [
            "年達",
            "静"
        ],
        455: [
            "【昔留然",
            "】和年"
        ],
        456: [
            "【",
            "】"
        ],
        457: [
            "【開",
            "】保"
        ],
        458: [
            "壁械静色",
            "鮮抜景"
        ],
        460: [
            "封施",
            "印"
        ],
        461: [
            "衛屈令",
            "閉奴"
        ],
        464: [
            "補留",
            "憩困"
        ],
        467: [
            "科張",
            "緊"
        ],
        468: [
            "科",
            ""
        ],
        469: [
            "案",
            ""
        ],
        470: [
            "考観予貰噂親承役貸困】",
            "胆察算娘耳痛諾喜友【"
        ],
        471: [
            "従簡",
            "停寄"
        ],
        472: [
            "仕任座",
            "管緒"
        ],
        473: [
            "細働戻日若晚飯抜監夫由頑昼科申扱険派易損況幻璧",
            "奴仕腹根朝寝罰似丈熱普張絶緊訳危討専起絡駄脱"
        ],
        474: [
            "付飯寝由夫派迎戻惑捜識文張望軽父怖策劇仕肌】祈",
            "緒昼奴丈彼歓興迷娘協談痛希任栄普嘘悲靴泣【幸"
        ],
        475: [
            "再",
            "戻"
        ],
        476: [
            "岩【",
            "飽】"
        ],
        477: [
            "色斐【",
            "年飽】"
        ],
        487: [
            "予",
            "涙"
        ],
        489: [
            "送",
            ""
        ],
        492: [
            "付様因飾奴",
            "遅璧油趣"
        ],
        495: [
            "印派予奴",
            "為恩想簡"
        ],
        499: [
            "【】答瞬渡抜起抗色揮権識送慣像僕歳怖景停   紙歓親 登承余仕輩様普孤院年悔途",
            "仮疑派求屈殼抵再服徒夜去微想戻争望深江    彼迎勢  志荷責願緒捜児若痛迷端"
        ],
        500: [
            "歳親服似考",
            "日母髮僕拷"
        ],
        501: [
            "夫緒叫",
            "婦泣"
        ],
        502: [
            "【読妻許",
            "】労耐"
        ],
        504: [
            "僕泣",
            "許"
        ],
        505: [
            "年尽怖劇捜再張",
            "日志悲幕泣緊"
        ],
        506: [
            "壁付予僕【】印考戻泣緊",
            "証伏想痛仮昔胸駄叫絶雇"
        ],
        507: [
            "然夫年誘旅声去戻",
            "丈彼貸拐娘妖瞬送"
        ],
        508: [
            "勢争僕悔",
            "親沢声"
        ],
        509: [
            "灯孤院替由刻去歳頑仕姉登批険",
            "台児副脳深様僕考張恋親償危許"
        ],
        510: [
            "親",
            ""
        ],
        516: [
            "旅夫衛幸",
            "丈護願迷"
        ],
        518: [
            "穴",
            ""
        ],
        520: [
            "【",
            "】"
        ],
        521: [
            "拘",
            ""
        ],
        523: [
            "遅",
            ""
        ],
        524: [
            "簡遭年周況",
            "渡遇考困"
        ],
        525: [
            "考従志",
            "令奴冴"
        ],
        526: [
            "適",
            ""
        ],
        527: [
            "土測周付遭【到",
            "予拡抜算遇】達"
        ],
        529: [
            "【妙達",
            "】普"
        ],
        530: [
            "仮",
            ""
        ],
        531: [
            "仮",
            ""
        ],
        532: [
            "監達採冒",
            "旅盛払険"
        ],
        533: [
            "寄許",
            "困"
        ],
        534: [
            "考隔補付観準【抜科送症困",
            "簡願許娘察従】年和届尽"
        ],
        536: [
            "許",
            "屈"
        ],
        537: [
            "姿",
            "様"
        ],
        539: [
            "執考働識似驚脳析簡礎狙普捜抜狩抗悔児姉妻婦幸偶脱絶泣誘旅稼謝興革仕答様",
            "組妖短送去昔微械派晴責推醒歳低親孤院営夫暮年然遅貸服拐映戻才論騒忙阻"
        ],
        540: [
            "填軌",
            "誤"
        ],
        541: [
            "職丈案旅盛採冒",
            "緑夫監達 払険"
        ],
        542: [
            "職脱旅盛払険】",
            "緑監達採冒【"
        ],
        544: [
            "職簡到危考緒済護丈郎願悩",
            "距填任険準例抑衛夫証論彼"
        ],
        545: [
            "職首】危",
            "【都巻憩"
        ],
        546: [
            "職",
            "憩"
        ],
        547: [
            "遅様衛彼寝】昔",
            "姫護準怖【老"
        ],
        548: [
            "老昼焼",
            "朝夕"
        ],
        549: [
            "起科侵囲",
            "都達周戻"
        ],
        551: [
            "起",
            ""
        ],
        552: [
            "然",
            "証"
        ],
        555: [
            "透由",
            "穴故"
        ],
        556: [
            "【",
            "】"
        ],
        557: [
            "裁",
            ""
        ],
        560: [
            "裁",
            ""
        ],
        561: [
            "鍵",
            ""
        ],
        562: [
            "【",
            "】"
        ],
        564: [
            "裁",
            ""
        ],
        568: [
            "鍵",
            ""
        ],
        569: [
            "替",
            "印"
        ],
        570: [
            "裁",
            ""
        ],
        572: [
            "鍵扉",
            "閉裁"
        ],
        573: [
            "痛薄恋辱耐唯祟",
            "考友屈悔細永"
        ],
        574: [
            "替",
            ""
        ],
        575: [
            "替",
            ""
        ],
        576: [
            "替扉",
            "床錆"
        ],
        578: [
            "鍵",
            ""
        ],
        579: [
            "読",
            "絵"
        ],
        580: [
            "洪病",
            "臆服"
        ],
        581: [
            "寝並",
            "張木"
        ],
        582: [
            "声",
            "替"
        ],
        583: [
            "【印奥",
            "】準"
        ],
        585: [
            "替",
            ""
        ],
        586: [
            "裁",
            ""
        ],
        587: [
            "裁",
            "印"
        ],
        588: [
            "鍵",
            ""
        ],
        592: [
            "裁",
            ""
        ],
        594: [
            "演",
            "奏"
        ],
        595: [
            "鍵",
            "替"
        ],
        596: [
            "【印",
            "】許"
        ],
        600: [
            "似貴願迷考郎瞬張文填嫌",
            "声管幸惑故狙緊耐句品"
        ],
        601: [
            "察為志【申模色昔",
            "忠嫌町】訳様塗"
        ],
        603: [
            "ｚ親吹",
            "週日"
        ],
        604: [
            "捜辛",
            "願飲"
        ],
        605: [
            "捜辛",
            "願飲"
        ],
        610: [
            "【狙任抜",
            "】責彼"
        ],
        611: [
            "【雰夜印僕",
            "】囲横役"
        ],
        612: [
            "【監達採冒",
            "】旅盛払険"
        ],
        613: [
            "釣年詫Ⅲ】夫干嫌張宿",
            "仮達印【丈声渉頑戻"
        ],
        615: [
            "泊被模声緊戸掃従徊戒況文美",
            "衝害様凄張締論排噂盛録忙派"
        ],
        616: [
            "釣若職張頑求賛責胸史故付僕【読",
            "恩録奴達駄魅誇嬉歴送絵含旅】"
        ],
        617: [
            "困志凄泣拾】囲簡様慢夫頑軽",
            "然喜職躍【寄暇貴叩丈窓張読"
        ],
        618: [
            "役緒日演答然彼懸案",
            "談慣曲奏誤夜考提証"
        ],
        621: [
            "築徒",
            "声没"
        ],
        622: [
            "考辛抱眉寄",
            "揮起悩毛答"
        ],
        623: [
            "捜",
            ""
        ],
        624: [
            "仕深考緒",
            "嫌想奴"
        ],
        625: [
            "障僕【奴寄",
            "役貸】便故"
        ],
        626: [
            "聴被幸普久叩年並戻起傷肉丈専珍毎飲拠冗“歌権妙",
            "勢害甚考奴駄怖職達若僕派夫許釣日証康談”美屈"
        ],
        627: [
            "町張猫",
            "頑僕"
        ],
        628: [
            "迷娘邪年匹釣旅親母況僕",
            "惑考仕猫老若然輩働町"
        ],
        629: [
            "娘令責友",
            "様願任"
        ],
        631: [
            "句貰釣池騒日軽晚求筋親昔廃粋随百縄達 駄役考馬慮遅申迎嫌夫",
            "匠Ⅲ飽寝慢潰危飯商♪友職▽派史汽由漁 弁十若鹿緒敬訳戻丈旅"
        ],
        632: [
            "悔迎夫【",
            "歓丈慢】"
        ],
        633: [
            "日揮任兼演彼組渡曲駄迎",
            "協就祝友奏譜役談僕夜"
        ],
        634: [
            "曲途贈奏",
            "若祝演"
        ],
        635: [
            "日揮任兼演彼組渡曲",
            "協就祝友奏譜役談"
        ],
        637: [
            "仕彼談惑団",
            "組権迷嫌戻"
        ],
        638: [
            "刑親令夫",
            "戻父丈脱"
        ],
        639: [
            "刑親令夫",
            "戻父丈"
        ],
        640: [
            "起危標妨阻潜考句仕令従柔",
            "戻険僕害願簡文侵任依権"
        ],
        642: [
            "緊丈迷",
            "許夫惑"
        ],
        644: [
            "材",
            ""
        ],
        646: [
            "父日",
            "母"
        ],
        648: [
            "【服狙働",
            "】危泣起"
        ],
        649: [
            "【",
            "】"
        ],
        650: [
            "宿仮囲",
            "泊雰"
        ],
        651: [
            "泊宿服歓貸那監達採冒",
            "由昼日迎旦毎旅盛払険"
        ],
        654: [
            "遊服",
            "友仕"
        ],
        655: [
            "片",
            ""
        ],
        656: [
            "脱普看ヶ辞娯幸職似戻夜恋載妖",
            "惨年病捜屈日就働声歌曲婚仕"
        ],
        657: [
            "婚泣病望寝舎暮副【疲借払",
            "痛看志汚田静腹匹】日然恩"
        ],
        658: [
            "静芸例毎薄町邪緒",
            "幽香想日去願困"
        ],
        660: [
            "坊舎町穫繋日年",
            "田咲彼役冠境暇"
        ],
        661: [
            "若",
            "屈"
        ],
        662: [
            "日屈興麗毎咲植",
            "嫌片綺彼年繰"
        ],
        664: [
            "起寝片渡若役策僕冗驚凝",
            "仕冑姿親旅派寄寒談困"
        ],
        665: [
            "予邪戻妖",
            "嫌副恩仕"
        ],
        666: [
            "若雇甘卒輩張肢飯払",
            "旅傭痛徒頑途暮呂"
        ],
        667: [
            "毎旅",
            "日"
        ],
        668: [
            "片",
            ""
        ],
        669: [
            "朴働争日途親戒考仕拐",
            "疑盛恩僕困任年恥誘捜"
        ],
        670: [
            "付酒傭絶起寄僕",
            "糖踏遊昔年戒"
        ],
        675: [
            "契然想誇",
            "偶奴像誤"
        ],
        676: [
            "【",
            "】"
        ],
        677: [
            "僕再史偏府達都雰",
            "送歴科政噂首滞囲"
        ],
        679: [
            "雰静奴歴徒噂",
            "囲任就史絡"
        ],
        682: [
            "【訪迷肢",
            "】奥考"
        ],
        685: [
            "【",
            "】"
        ],
        686: [
            "奥】渡仕裁嘘訪",
            "【令予緒刑似"
        ],
        687: [
            "危",
            "険"
        ],
        688: [
            "派役善",
            "障日忌"
        ],
        689: [
            "丈日忌希底答",
            "夫善忠望再様"
        ],
        690: [
            "【省掛",
            "】徒"
        ],
        691: [
            "陰西傘妙",
            "勢都微"
        ],
        692: [
            "【",
            "】"
        ],
        693: [
            "鍵】",
            "【"
        ],
        694: [
            "疲依",
            "労"
        ],
        696: [
            "鍵】",
            "【"
        ],
        697: [
            "鍵】",
            "【訪"
        ],
        699: [
            "鍵】",
            "【"
        ],
        700: [
            "鍵】洗日",
            "【戻脳訪"
        ],
        702: [
            "授責政達刑巻考奴恋夏歳児囲悔去",
            "独任府裁執悟然親年日彼範嫌討由"
        ],
        703: [
            "年】僕",
            "【徒"
        ],
        704: [
            "団夫僕",
            "丈烈"
        ],
        706: [
            "【徒",
            "】抜"
        ],
        707: [
            "【徒授潜",
            "】僕占"
        ],
        708: [
            "徒歴繰拠宿許",
            "争史噂日免"
        ],
        712: [
            "徒届従討論準勢府節脅怖例達託秀璧許僕夫距都幸考",
            "令規検協至任政和談迫公拠肢狙彼遂仕丈緒首労到慮"
        ],
        713: [
            "労僕到慮節",
            "緒幸考任"
        ],
        714: [
            "【",
            "】"
        ],
        715: [
            "久恩郎駄群役】",
            "母年徒届張【"
        ],
        716: [
            "狙独悟侵",
            "孤宿趣刻"
        ],
        717: [
            "座飲登仕日抜丈普姿考張提借囲般福乾迎熱",
            "疲文夜任腰戻夫悩邪緊困案雰耳至輝杯遂"
        ],
        718: [
            "注俺刑緊足",
            "文夜功張"
        ],
        720: [
            "西危便奴歓",
            "到険政若迎"
        ],
        721: [
            "怖争揮姿史侵昔再占西簡酒硬像映閉掛",
            "団愚並歴脅然厚蓄狂娘考窓読予絵仕親"
        ],
        722: [
            "令願父娘府",
            "契彼親政停"
        ],
        723: [
            "願抑任抗【】揮排牲",
            "脱考娘遊狙総採犠払"
        ],
        724: [
            "令任傭邪",
            "価契戻硬"
        ],
        726: [
            "【組仕令総僕府",
            "】考契願稼政協"
        ],
        727: [
            "【",
            "】"
        ],
        728: [
            "夜】周奴日紙送",
            "【公善毎様想刻"
        ],
        729: [
            "【刻盤簡裕娘準",
            "】瞬閉余起由"
        ],
        731: [
            "到】棒",
            "【茶揮"
        ],
        733: [
            "【",
            "】"
        ],
        735: [
            "閉怯",
            "卑仕"
        ],
        736: [
            "【予払泊伺専旅盛冒",
            "】預宿様案監達採険"
        ],
        737: [
            "【読",
            "】"
        ],
        738: [
            "仮然張飲緒読章寝詞夫悩包令】",
            "座緊聴酒奴文載歌丈傷辛微【"
        ],
        739: [
            "僕史狙】害",
            "歴考【障"
        ],
        740: [
            "【】",
            "狙"
        ],
        741: [
            "都宿騒故到】滞熱護瞬猛起揮争",
            "寄泊夜郷【渋彼醜奴美躍若狙"
        ],
        742: [
            "到】停怖昔奴美様模組",
            "【授日魅卒考甘規準"
        ],
        743: [
            "到】狙環戻首停様怖模例",
            "【潜周再曲都拠晴規底争"
        ],
        744: [
            "騒狙観較想邪幸",
            "【】衆予拠戻祈"
        ],
        746: [
            "贄儀狙標扉",
            "酷【】床"
        ],
        747: [
            "【遊",
            "】"
        ],
        750: [
            "様",
            "拠"
        ],
        751: [
            "【】奴",
            "狙例善"
        ],
        753: [
            "趣察役",
            "偵任"
        ],
        754: [
            "薄愚想酷善悲焼温郷堵怖劫美",
            "汚幻衣儀慈緑払故凍舞永甘"
        ],
        755: [
            "【",
            "】"
        ],
        756: [
            "【到危端服酒勢僕恋労",
            "】美険疲飲醉勘緒任"
        ],
        757: [
            "飲酔勘緒任",
            "酒勢僕恋労"
        ],
        758: [
            "【到",
            "】"
        ],
        760: [
            "討送権若争",
            "伐契託都再"
        ],
        761: [
            "【到宅絡証様毎昨彼課渡答便価悔権",
            "】任簡労宿訪日戻痕奥脱送挑軽政例"
        ],
        767: [
            "娘日拶令",
            "父挨贈"
        ],
        768: [
            "腐",
            ""
        ],
        769: [
            "準干遅刻標敬服妨省丈",
            "若予管座侵脱邪害械夫"
        ],
        770: [
            "脱扉",
            "繰"
        ],
        771: [
            "盤様",
            "模因"
        ],
        772: [
            "忙日】令夫",
            "検【司丈"
        ],
        773: [
            "【】送巡級座丈考",
            "標誤戻航般杯夫映"
        ],
        774: [
            "検甘観",
            "去声仕"
        ],
        775: [
            "服阻",
            "秒"
        ],
        776: [
            "様訳準閉予日暮腹",
            "申郎縦短想考悟僕"
        ],
        777: [
            "端座核検",
            "労標到令"
        ],
        778: [
            "叫】巻",
            "【脱戻"
        ],
        779: [
            "検戒替狭親謝普訳障械",
            "厳勢抜並派然慎故任案"
        ],
        781: [
            "源座労管任達派到】許再",
            "替標傷巻友遂役【識起"
        ],
        782: [
            "侵排僕遭",
            "緊源辛仕"
        ],
        783: [
            "板日肉踏脱】",
            "読彼資戻【"
        ],
        784: [
            "脱】",
            "【"
        ],
        785: [
            "脱】",
            "【"
        ],
        786: [
            "脱】",
            "【"
        ],
        787: [
            "脱】",
            "【"
        ],
        788: [
            "像】",
            "【脱"
        ],
        789: [
            "脱】",
            "【"
        ],
        790: [
            "【脱",
            "】"
        ],
        791: [
            "様棺考疲旅脱】",
            "狭永俗冥閉【"
        ],
        792: [
            "【",
            "】"
        ],
        793: [
            "扉",
            ""
        ],
        794: [
            "脱",
            ""
        ],
        795: [
            "声脱投壁任【",
            "緒予周耳戻】"
        ],
        797: [
            "脱",
            ""
        ],
        798: [
            "丈僕令扉刑脱詳横任",
            "夫父捕埋潜声案考"
        ],
        799: [
            "拷嬢】",
            "騒【"
        ],
        800: [
            "予遷余刑怯【",
            "囚腹年卑簡】"
        ],
        801: [
            "友働暮脱掃府捕郎",
            "刑喜彼派政逮然"
        ],
        802: [
            "抑悔",
            "仕"
        ],
        803: [
            "拷考談看",
            "脱冗掃邪"
        ],
        804: [
            "仮識",
            "傷囲"
        ],
        805: [
            "起",
            ""
        ],
        807: [
            "派戻",
            "埋"
        ],
        808: [
            "座囚排",
            "標許送"
        ],
        809: [
            "再刑",
            "挟戻"
        ],
        810: [
            "想誇簡令秒姿絶宿抗準仕猟匹和脱",
            "像傭栄郎晴拷憎抵様罪狩尋張起"
        ],
        811: [
            "起",
            "脱"
        ],
        812: [
            "閉鍵戻房由",
            "脱扱独穴"
        ],
        813: [
            "任",
            ""
        ],
        814: [
            "危普丈黄",
            "潜抵夫色"
        ],
        815: [
            "考夫任色",
            "丈許黄起"
        ],
        816: [
            "【任",
            "】"
        ],
        819: [
            "【",
            "】"
        ],
        820: [
            "争還",
            "屈"
        ],
        821: [
            "仮",
            ""
        ],
        822: [
            "政絡送勢静望夫考",
            "府捕様晴希丈勇到"
        ],
        823: [
            "若謝況",
            "干服去"
        ],
        824: [
            "担考",
            "久"
        ],
        826: [
            "予縦答ｗ把年丈誘舷抑幸座慣孤院緒和像絶抱喜焼妬証許脱印",
            "戻械ｏ貴握充夫仕簡措祈締親児勢忙想損母父腹餅去考幾還従"
        ],
        827: [
            "【】証恥想許仕児彫戻忙況願丈怖送",
            "仮簡奪考像悔孤院普腹承狙昔夫去志"
        ],
        828: [
            "縦答ｗ把戻充夫仕簡措祈締親損母父腹餅去考幾還従",
            "械ｏ貴握年丈誘舷抑幸座慣緒絶抱喜焼妬証許脱印"
        ],
        830: [
            "団矢仕担夫遊",
            "挑凄達丈況"
        ],
        831: [
            "【】争考姫僕騒昔印推矢嫌渡簡",
            "仮脱送深様然承底巻迎望権声"
        ],
        832: [
            "艦殖彼再ｍ忍含険測徵求色",
            "繁去日想狂肉危推例踏祈"
        ],
        834: [
            "考座標】卑承送友迎派母似仕",
            "縦横【寝怯去戻緒勇演親父"
        ],
        835: [
            "『繁仮除彼再残狂忍主危可在測更別初後求祈",
            "艦殖』去日想ｍ暴肉含険存推例他最感踏健"
        ],
        837: [
            "軸薄",
            "希"
        ],
        838: [
            "【飲",
            "】"
        ],
        840: [
            "緊危去",
            "域険"
        ],
        841: [
            "微慮父団毎印",
            "協親似遊飽"
        ],
        843: [
            "晴微採",
            "付嘆雇"
        ],
        844: [
            "友",
            ""
        ],
        846: [
            "日稼囲嫌鼠望悲仕故猛",
            "朽雰鳴蒼訳慈乞愚興"
        ],
        847: [
            "猛】",
            "【"
        ],
        848: [
            "凄掛様派材想",
            "艦達採噂予"
        ],
        849: [
            "久識護夫緒仕親迎溺恩困日妹付【故",
            "拾許丈戻独年寂慕声厳噂様邪座】郷"
        ],
        850: [
            "僕",
            ""
        ],
        851: [
            "張縦困例丈毎肉僕嫌労腹】",
            "屈仕簡迎夫日罰危求煮【読"
        ],
        852: [
            "団遇索故",
            "遭捜僕障"
        ],
        853: [
            "揮刻護願胎識興日凍謝亡担張",
            "僕求由敏児母深然戻親久緊疲"
        ],
        854: [
            "姉服孫昼様役尽恵停奪耳蛮抜考渡",
            "彼日勉夜驚焼抗困裂争答粗殻付捜"
        ],
        855: [
            "隻付拒囲",
            "横僕周"
        ],
        856: [
            "様然去",
            "叫僕"
        ],
        857: [
            "僕謝証簡紙申遭索障準起横拒囲叫去泊致",
            "戻敬拠願捜団遇故渡巻隻付周様然停慣補"
        ],
        858: [
            "渡準",
            "僕"
        ],
        859: [
            "材渉妨及監",
            "干付害年"
        ],
        860: [
            "印監",
            "躍怠"
        ],
        861: [
            "凍年娘",
            "療若彼"
        ],
        862: [
            "暇服驚歴繰妙潮十周傷印危滝脱",
            "管普涙史微群似年起都許険飲送"
        ],
        864: [
            "補周衛仕",
            "群護起組"
        ],
        865: [
            "久役由送危",
            "巻去予起険"
        ],
        866: [
            "替茶日",
            "服印予"
        ],
        867: [
            "【奥",
            "】療"
        ],
        868: [
            "療",
            ""
        ],
        869: [
            "職",
            "悔"
        ],
        870: [
            "【",
            "】"
        ],
        871: [
            "服予考戻危噴",
            "維願去起険尽"
        ],
        872: [
            "日",
            ""
        ],
        874: [
            "危駄考印付滞怖戻衛",
            "険管監璧ヶ年逆護"
        ],
        875: [
            "年印服補脱",
            "邪都群棄還"
        ],
        877: [
            "維秒停  声漂",
            "量駄  予酸"
        ],
        878: [
            "ｘ永渡距",
            "ｙ浪刻央"
        ],
        879: [
            "絶考句奴緒暮僕孤院然由旅",
            "討文声都迎辛歳児仕普去答"
        ],
        880: [
            "孤院緒嫌況望許組",
            "児僕友杯卒歌団歯"
        ],
        881: [
            "深",
            "考"
        ],
        882: [
            "緒",
            ""
        ],
        883: [
            "孤院去【妖",
            "児因起】贈"
        ],
        884: [
            "緒夫徒坊頑嬉彼舖借占僕授太",
            "丈様寝日張喜友仕興絶隣縁陽"
        ],
        885: [
            "病疲謝泣絶起周願",
            "看許寂喜徒日志緒"
        ],
        886: [
            "友想奥悲日贈善再付価願廃由張徒募薄毛緒",
            "適然彼寒妖母例寄評恵夜墟頑甘嬉幸髮起"
        ],
        887: [
            "遂届張日【読",
            "聴頑彼去】"
        ],
        888: [
            "【日算冗財友抜驚",
            "】品九談像緒僕遊"
        ],
        889: [
            "興済",
            "僕"
        ],
        890: [
            "昼争徒去況歴僕逸揃",
            "競日刻副崩載年材忙"
        ],
        891: [
            "様",
            "腹"
        ],
        892: [
            "焦昼【】彼丈腹拉頑柄脱考送",
            "姫寝奥途雇夫準致張拘展声横"
        ],
        893: [
            "適独希裁都様悔送沢年考乙遣為予令達紙文抜慄済臨愕就華肉彼府湯企拍遮距標捉刷",
            "派争評首腹準【】域凄契丙締含想従然親句読政和驚若任飾刻勃税逆悟衝唯脅捕印"
        ],
        894: [
            "姫起到傷護簡予夫嫌抜政絶働老興父年狩奴屍底途【",
            "奥胸停声衛座丈覗付張済普盛抗親昔日盾背緒仕詳】"
        ],
        895: [
            "踊  然貧戻役",
            "  依捜乏任仕"
        ],
        896: [
            "模色護替去致根仕普暇並戻衝願温服範枠隙渡付駄頑途憎丸簡",
            "黄似衛抜拉展慎詳嫌細脱勢短声徵窓囲管然例秒考張塗横太■"
        ],
        897: [
            "飲母【",
            "姉親】"
        ],
        898: [
            "令",
            "依"
        ],
        899: [
            "郎送彼惑繁幸棄娘訪張昔投匹捜徒普抜控迎棒",
            "【】迷奴栄求脅盾頑幼毛逆背紙付西派歓猫"
        ],
        900: [
            "泊奴仕捕頑脱茶払模談曲深趣募】",
            "声油姉嬉張付案父冗噂奥似魅【"
        ],
        901: [
            "■危勇年】",
            "幼髪敢【読"
        ],
        902: [
            "【護奴距例秒駄逆頑■慎侵",
            "】衛服戻付座準替張然筋"
        ],
        903: [
            "【護戻付座替張然筋",
            "】衛例秒駄頑■慎侵"
        ],
        904: [
            "【読企美社商若年紙望争送恵奴",
            "】僕肌忠職困況略志朝愚幸夫昔"
        ],
        905: [
            "昔",
            "若"
        ],
        906: [
            "朝日",
            "昨若"
        ],
        908: [
            "由望年読",
            "希美若"
        ],
        909: [
            "若嫌慮然涙促棚簡年奴母日暮傷泣",
            "飲蛇軽昔旅扉付戸老狭毎働恋曲姉"
        ],
        910: [
            "【】仕窓母想彼織丈美疲緊絡脱頑双娘親",
            "送徒昔談父首組似夫貌還寄西躍張謝働嬉"
        ],
        911: [
            "窓疲夫遺傷望",
            "額丈派組浅狩"
        ],
        912: [
            "奥幻旅因拉騒迷阻様酔黄若扱文儀拾詳彼固",
            "普飲般縁致起惑郎酒綠色邪嫌杯張甘深頑困"
        ],
        913: [
            "彼拘喋罰戻挙任",
            "柄郎懲脱総潰"
        ],
        914: [
            "哀想求戻",
            "年窮恥"
        ],
        915: [
            "丈",
            "夫"
        ],
        916: [
            "猫投娘送",
            "嫌飼困独"
        ],
        917: [
            "奴絡若危拉挑日",
            "訪組般害致眺郎"
        ],
        918: [
            "例寝】壁付涙丈嬉似舎到",
            "奴【送戻泊爺夫貴田迷只"
        ],
        919: [
            "旅遊窓◆模□★仕熱】只",
            "病暇並涙飲■争年【到"
        ],
        920: [
            "【送隣踊煮肝麗仕頑絶緒令丈",
            "】細歌奴詰華願彼張閉戻日夫"
        ],
        921: [
            "【奴若十和努観川幻送匠傷深静侵老騒渡痛独彼",
            "】働熱魅日油察飲年夜様由囲美略矢起腹緒便許"
        ],
        922: [
            "田奴捕】只",
            "舎抗【到"
        ],
        923: [
            "橋険卒】",
            "危遊【"
        ],
        924: [
            "背掴服途往【由到",
            "声想父暮為】西只"
        ],
        925: [
            "般嫌任絶再抗害奴軽疲辱",
            "到駄労彼抵危嬢噂座侮"
        ],
        926: [
            "ｂｉｍｋｈｖｌｕ周仕悟床組途簡遊戻夫",
            "ｒｎｃｔａｗｏｆ送従令座織勘雇痛丈"
        ],
        927: [
            "張駄幅",
            "抜太"
        ],
        928: [
            "姿送再訳奮輝",
            "声年申興日様"
        ],
        929: [
            "提争暮幾彼刺貸",
            "案和憾騒雇許"
        ],
        930: [
            "【衛含張",
            "護】頑"
        ],
        931: [
            "般困ｋ絶",
            "声ｏ温"
        ],
        932: [
            "専",
            ""
        ],
        933: [
            "余奥",
            "房像"
        ],
        935: [
            "老伸唯付頑考様【適嫌識愚達敬焦才令声像是誘途屈幸戻痛狭頂贈尽寄品驚眼",
            "背宿絶凄固彼由】任仕逆曲殿境許肉房借掛年拐短便労旅飯申願呈謝謁志嘆惜"
        ],
        936: [
            "座許到声",
            "商訪致殿"
        ],
        937: [
            "由奪達独老像許採訳仕",
            "逆奴壁暮付商談遊木"
        ],
        938: [
            "困夫服  旅盛払険",
            "努克泊曲監達採冒"
        ],
        939: [
            "【読",
            "】"
        ],
        940: [
            "年老由枠困答短邪彼予賊誤僕迷歓労静謝池曲奏文奇熱",
            "像房魅嫌役昔殿声驚絶張凄十惑迎様尽釣案 演権句抑"
        ],
        941: [
            "声老曲仕璧囲慣奴凄勉昔傷詳貴飼徴姿抵紅識便悍瞳弁逆敬鳴群誉任暇量專為宿文奮考趣予補",
            "殿像魅双雰僕秀況緒似滑達久願盛映誇熱髮獣晴玉勢様毛美抜余役頂五駄談池然慕起十訳候"
        ],
        942: [
            "日友声像嫌依印絶汚価品洗】",
            "励贈奴再予訪晴望寄故栄【読"
        ],
        943: [
            "【鳴木貰彼敬論久考謝誇",
            "】声根老興歓遊抜迎様奇"
        ],
        944: [
            "釣誉提像飽達夫誘歓寄郷",
            "老昔映細池丈例縛迎故"
        ],
        945: [
            "貴望冗奥",
            "貰価談"
        ],
        946: [
            "泊準督",
            "役監映"
        ],
        947: [
            "鳴及句監似役邪",
            "声文替督演願"
        ],
        948: [
            "監絶邪替様",
            "督殿吹登"
        ],
        949: [
            "【",
            "】"
        ],
        950: [
            "鳴匹",
            "声"
        ],
        965: [
            "【箱徒脱貸録",
            "】噂雇傭細"
        ],
        966: [
            "案",
            "様"
        ],
        967: [
            "準",
            "穴"
        ],
        974: [
            "僕",
            ""
        ],
        975: [
            "答",
            "声"
        ],
        976: [
            "【",
            "】"
        ],
        979: [
            "仕考",
            "承"
        ],
        980: [
            "勢供争沢声元",
            "子親頃僕悔"
        ],
        981: [
            "感台児副脳深様僕独歳私供張恋残償危許",
            "灯孤院替由刻去遊占離子頑仕姉登批険"
        ]
    };
    function interleaveCharsetEvenOdd() {
        let dynamic_charset = [];
        for(const id in charset_evn_odd) {
            const item = charset_evn_odd[id];
            const total_length = item[0].length + item[1].length;
            let value = "";
            for(let i = 0; i < total_length; i++){
                const file = i & 1; // i%2
                const index = i >>> 1; // Math.floor(i / 2)
                value += item[file][index];
            }
            dynamic_charset[id] = value;
        }
        return dynamic_charset;
    }
    let charset = {
        "efigs": [
            " ", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "%", "/", ":", "!", "?",
            "…", "+", "-", "=", "*", "&", "「", "」", "(", ")", "·", ".", ",", "~", "“", "”",
            "‘", "#", "$", "'", "_", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K",
            "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "a",
            "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q",
            "r", "s", "t", "u", "v", "w", "x", "y", "z", "À", "Á", "Â", "Ä", "Ç", "È", "É",
            "Ê", "Ë", "Ì", "Í", "Î", "Ï", "Ñ", "Ò", "Ó", "Ô", "Ö", "Ù", "Ú", "Û", "Ü", "Œ",
            "ß", "à", "á", "â", "ä", "ç", "è", "é", "ê", "ë", "ì", "í", "î", "ï", "ñ", "ò",
            "ó", "ô", "ö", "ù", "ú", "û", "ü", "œ", "\0", "[", "]", "■", "○", "♦", "【", "】",
            "□", "\0", "『", "』", "\0", ";", "\0", "¯", "×", "\0", "ʼ", "↓", "°", "¡", "¿", "─",
            "«", "»", "±", "♫", "{xC4}", "↑", "{VI}", "{II}", "{xC8}", "™", "<", ">", "{xCC}", "{xCD}", "{xCE}", "{xCF}",
            "{xD0}", "{xD1}", "{xD2}", "\0", "{xD4}", "{xD5}", "{xD6}", "{xD7}", "{xD8}", "{xD9}", "{xDA}", "{xDB}", "{xDC}", "{xDD}", "{xDE}", "{xDF}",
            "{xE0}", "{xE1}", "®", "\0", "\0", "\0", "\0", "\0", "{in}", "{e }", "{ne}", "{to}", "{re}", "{HP}", "{l }", "{ll}",
            "{GF}", "{nt}", "{il}", "{o }", "{ef}", "{on}", "{ w}", "{ r}", "{wi}", "{fi}", "{EC}", "{s }", "{ar}", "{FE}", "{ S}", "{ag}"
        ],
        "jp": [
            "バ", "ば", "ビ", "び", "ブ", "ぶ", "ベ", "べ", "ボ", "ぼ", "ガ", "が", "ギ", "ぎ", "グ", "ぐ",
            "ゲ", "げ", "ゴ", "ご", "ザ", "ざ", "ジ", "じ", "ズ", "ず", "ゼ", "ぜ", "ゾ", "ぞ", "ダ", "だ",
            "ヂ", "ぢ", "ヅ", "づ", "デ", "で", "ド", "ど", "ヴ", "パ", "ぱ", "ピ", "ぴ", "プ", "ぷ", "ペ",
            "ぺ", "ポ", "ぽ", "０", "１", "２", "３", "４", "５", "６", "７", "８", "９", "、", "。", " ",
            "ハ", "は", "ヒ", "ひ", "フ", "ふ", "ヘ", "へ", "ホ", "ほ", "カ", "か", "キ", "き", "ク", "く",
            "ケ", "け", "コ", "こ", "サ", "さ", "シ", "し", "ス", "す", "セ", "せ", "ソ", "そ", "タ", "た",
            "チ", "ち", "ツ", "つ", "テ", "て", "ト", "と", "ウ", "う", "ア", "あ", "イ", "い", "エ", "え",
            "オ", "お", "ナ", "な", "ニ", "に", "ヌ", "ぬ", "ネ", "ね", "ノ", "の", "マ", "ま", "ミ", "み",
            "ム", "む", "メ", "め", "モ", "も", "ラ", "ら", "リ", "り", "ル", "る", "レ", "れ", "ロ", "ろ",
            "ヤ", "や", "ユ", "ゆ", "ヨ", "よ", "ワ", "わ", "ン", "ん", "ヲ", "を", "ッ", "っ", "ャ", "ゃ",
            "ュ", "ゅ", "ョ", "ょ", "ァ", "ぁ", "ィ", "ぃ", "ゥ", "ぅ", "ェ", "ぇ", "ォ", "ぉ", "Ａ", "Ｂ", "Ｃ",
            "Ｄ", "Ｅ", "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ", "Ｋ", "Ｌ", "Ｍ", "Ｎ", "Ｏ", "Ｐ", "Ｑ", "Ｒ",
            "Ｓ", "Ｔ", "Ｕ", "Ｖ", "Ｗ", "Ｘ", "Ｙ", "Ｚ", "！", "？", "…", "＋", "－", "＝", "＊", "／",
            "％", "＆", "「", "」", "（", "）", "収", "容", "所", "駅", "・", ".", ",", "：", "～", "ー"
        ],
        "jp19": [
            "ｅ", "Ⅷ", "悪", "安", "暗", "闇", "以", "異", "違", "一", "員", "右", "運", "鋭", "液", "越",
            "園", "援", "炎", "煙", "押", "屋", "音", "下", "化", "何", "果", "火", "我", "会", "回", "快",
            "海", "格", "確", "覚", "学", "喚", "完", "間", "関", "岸", "顔", "器", "機", "気", "技", "吸",
            "急", "給", "居", "巨", "共", "強", "恐", "近", "金", "空", "軍", "形", "警", "撃", "激", "血",
            "月", "剣", "見", "験", "減", "言", "個", "呼", "己", "御", "光", "効", "口", "好", "攻", "校",
            "甲", "行", "降", "高", "合", "告", "黒", "獄", "今", "混", "佐", "左", "砂", "催", "殺", "三",
            "山", "散", "斬", "使", "士", "始", "止", "死", "試", "事", "持", "時", "次", "治", "自", "失",
            "実", "射", "捨", "弱", "取", "手", "殊", "受", "呪", "修", "終", "臭", "襲", "集", "出", "術",
            "女", "召", "将", "少", "消", "称", "笑", "上", "場", "常", "状", "食", "審", "心", "振", "新",
            "針", "震", "人", "刃", "水", "睡", "制", "性", "成", "整", "生", "精", "聖", "製", "青", "石",
            "切", "折", "説", "先", "千", "宣", "戦", "選", "全", "蘇", "早", "相", "装", "増", "即", "息",
            "速", "属", "続", "体", "対", "態", "袋", "隊", "代", "大", "択", "誰", "弾", "断", "男", "値",
            "地", "着", "中", "仲", "虫", "調", "超", "長", "沈", "追", "通", "低", "定", "敵", "的", "徹",
            "撤", "鉄", "店", "転", "点", "電", "吐", "怒", "倒", "刀", "塔", "盗", "当", "等", "統", "逃"
        ],
        "jp1A": [
            "頭", "闘", "動", "同", "特", "毒", "突", "内", "二", "入", "認", "能", "波", "敗", "倍", "買",
            "売", "爆", "発", "判", "半", "反", "班", "費", "避", "非", "飛", "備", "尾", "必", "不", "浮",
            "負", "武", "部", "風", "復", "物", "分", "兵", "平", "変", "返", "歩", "放", "方", "法", "砲",
            "防", "本", "魔", "味", "岬", "脈", "眠", "夢", "無", "名", "命", "明", "滅", "面", "黙", "目",
            "野", "薬", "与", "用", "要", "来", "雷", "落", "乱", "嵐", "理", "率", "流", "了", "料", "領",
            "力", "冷", "霊", "連", "狼", "嘯", "差", "込", "決", "×", "東", "前", "禁", "道", "具", "系",
            "設", "翼", "肩", "身", "知", "欠", "殴", "牙", "苦", "進", "魂", "作", "帰", "思", "兄", "弟",
            "仁", "義", "刊", "処", "助", "怪", "勝", "種", "程", "度", "際", "影", "界", "画", "表", "響",
            "項", "各", "得", "世", "獲", "基", "有", "割", "意", "情", "存", "加", "可", "他", "多", "示",
            "欲", "話", "経", "偽", "『", "』", "神", "暴", "支", "型", "遺", "医", "育", "宇", "塩", "応",
            "王", "家", "花", "階", "凱", "街", "官", "館", "記", "客", "教", "業", "局", "区", "掘", "窟",
            "渓", "計", "建", "研", "現", "庫", "湖", "工", "広", "構", "港", "荒", "講", "国", "査", "祭",
            "市", "室", "車", "住", "昇", "乗", "城", "森", "図", "正", "席", "跡", "接", "旋", "船", "層",
            "操", "造", "束", "族", "村", "谷", "探", "段", "宙", "柱", "駐", "庭", "艇", "邸", "島", "堂"
        ],
        "jp1B": [
            "洞", "念", "拝", "白", "漠", "畑", "編", "墓", "宝", "民", "務", "門", "洋", "裏", "陸", "立",
            "寮", "礼", "列", "路", "廊", "牢", "問", "績", "第", "退", "頼", "北", "砕", "究", "博", "書",
            "主", "々", "保", "健", "訓", "練", "施", "秘", "密", "向", "質", "配", "直", "利", "単", "数",
            "照", "指", "類", "注", "置", "最", "参", "交", "換", "号", "粉", "羽", "竜", "糸", "爪", "極",
            "南", "札", "英", "雄", "万", "彦", "骨", "筆", "習", "創", "雑", "誌", "題", "後", "改", "犯",
            "破", "壊", "導", "草", "菜", "球", "更", "偉", "未", "隠", "円", "輪", "触", "賢", "者", "皮",
            "溶", "解", "活", "角", "楽", "腕", "赤", "守", "鈴", "救", "師", "星", "忘", "信", "件", "結",
            "晶", "謎", "休", "燃", "古", "鳥", "銃", "原", "丘", "陵", "番", "諸", "雪", "天", "封", "鎖",
            "初", "記", "憶", "位", "期", "移", "足", "在", "報", "優", "写", "真", "順", "象", "帯", "議",
            "聞", "視", "走", "魚", "式", "俺", "騎", "鬼", "開", "外", "威", "君", "素", "比", "劣", "難",
            "遠", "愛", "皆", "紹", "介", "犬", "満", "枚", "字", "辺", "引", "小", "別", "除", "限", "両",
            "功", "良", "継", "伝", "過", "側", "重", "複", "係", "打", "語", "圏", "条", "互", "末", "倉",
            "敷", "私", "圧", "縮", "子", "供", "頃", "感", "葉", "残", "待", "離", "元", "否", "線", "約",
            "{xF0}", "\0", "\0", "\0", "\0", "\0", "\0", "\0", "\0", "\0", "\0", "\0", "\0", "\0", "\0", "\0"
        ],
        "jp1C": interleaveCharsetEvenOdd(),
    };
    return charset;
} 



// Use this with browser console to test strings. Not updated

// function encodeString(str) {
//     let result_str = ""
//     for (let c of str) {
//         let result = charset_jp.indexOf(c);
//         if (result !== -1) {
//             result_str += (result + 0x20).toString(16) + " ";
//             continue;
//         }
//         result = charset_jp19.indexOf(c);
//         if (result !== -1) {
//             result_str += "19" + " " + (result + 0x20).toString(16) + " ";
//             continue;
//         }
//         result = charset_jp1A.indexOf(c);
//         if (result !== -1) {
//             result_str += "1A" + " " + (result + 0x20).toString(16) + " ";
//             continue;
//         }
//         result = charset_jp1B.indexOf(c);
//         if (result !== -1) {
//             result_str += "1B" + " " + (result + 0x20).toString(16) + " ";
//             continue;
//         }

//         result_str += "1C ?? ";

//     }
//     return result_str
// }
// function decodeString(str) {
//     let bytes = str.split(" ");
//     let result_str = ""
//     let char = "";
//     let index = 0;
//     while (index < bytes.length) {
//         const code = parseInt(bytes[index], 16);
//         if (code < 0x20) {
//             switch (code) {
//                 case 0x0:
//                     return result_str;
//                 case 0x1:
//                 // New Lines
//                 case 0x2:
//                     char = "\n";
//                     result_str += char;
//                     index += 1;
//                     continue;
//                 // Names
//                 case 0x3:
//                     let char_name = names[parseInt(bytes[index + 1], 16)];
//                     result_str += char_name ? char_name : `[Name <0x${bytes[index + 1]}>]`;
//                     index += 2;
//                     continue;
//                 // Icon (controller/keyboard button)
//                 case 0x5:
//                 // Color
//                 case 0x6:
//                 // Delay
//                 case 0x9:
//                 // Special value
//                 case 0xA:
//                 // SpellID
//                 case 0xC:
//                     index += 2;
//                     continue;
//                 // Cursor locations
//                 case 0xB:
//                     index += 2; // 2 for now but it can also take 3 value
//                     continue;
//                 // 2 bytes charset 19
//                 case 0x19:
//                     char = charset_jp19[parseInt(bytes[index + 1], 16) - 0x20];
//                     result_str += char;
//                     index += 2;
//                     continue;
//                 // 2 bytes charset 1A
//                 case 0x1A:
//                     char = charset_jp1A[parseInt(bytes[index + 1], 16) - 0x20];
//                     result_str += char;
//                     index += 2;
//                     continue;
//                 // 2 bytes charset 1B
//                 case 0x1B:
//                     char = charset_jp1B[parseInt(bytes[index + 1], 16) - 0x20];
//                     result_str += char;
//                     index += 2;
//                     continue;
//                 // 2 bytes dynamic charset (depends on the scene id)
//                 case 0x1C:
//                     result_str += `<1c ${bytes[index + 1]}>`;
//                     index += 2;
//                     continue;
//             }
//         }
//         // Single byte charset
//         else {
//             result_str += charset_jp[code - 0x20];
//             index += 1;
//         }
//     }
//     return result_str
// }